import Mathlib

set_option linter.style.longLine false

open scoped BigOperators Topology Nat

open Filter

local notation:70 x " /. " y => ((x : ℝ) / (y : ℝ))

open scoped RealInnerProductSpace

noncomputable def lpFunDeri {E : Type*} [NormedAddCommGroup E] [InnerProductSpace ℝ E] [CompleteSpace E] (f g : E -> ℝ) : E -> ℝ :=
  fun x => (inner ℝ (gradient f x) (gradient g x)) /. (‖gradient g x‖ ^ 2)

def lpLeftDifferentiable (f : ℝ -> ℝ) : Prop :=
  ∀ x, DifferentiableWithinAt ℝ f (Set.Iio x) x

def lpRightDifferentiable (f : ℝ -> ℝ) : Prop :=
  ∀ x, DifferentiableWithinAt ℝ f (Set.Ioi x) x

def lpLeftDifferentiableOn (f : ℝ -> ℝ) (s : Set ℝ) : Prop :=
  ∀ x ∈ s, DifferentiableWithinAt ℝ f (s ∩ Set.Iio x) x

def lpRightDifferentiableOn (f : ℝ -> ℝ) (s : Set ℝ) : Prop :=
  ∀ x ∈ s, DifferentiableWithinAt ℝ f (s ∩ Set.Ioi x) x

def lpMaximumPoints {α β : Type*} [Preorder β] (f : α -> β) : Set α :=
  {x | ∀ y, f y ≤ f x}

def lpMinimumPoints {α β : Type*} [Preorder β] (f : α -> β) : Set α :=
  {x | ∀ y, f x ≤ f y}

def lpMaximumPointsOn {α β : Type*} [Preorder β] (f : α -> β) (s : Set α) : Set α :=
  {x | x ∈ s ∧ ∀ y ∈ s, f y ≤ f x}

def lpMinimumPointsOn {α β : Type*} [Preorder β] (f : α -> β) (s : Set α) : Set α :=
  {x | x ∈ s ∧ ∀ y ∈ s, f x ≤ f y}

noncomputable def lpRadiusOfConvergence {𝕜 : Type*} [NormedField 𝕜] (a : ℕ -> 𝕜) : ENNReal :=
  ⨆ (r : NNReal), ⨆ (_h : Summable (fun n : ℕ => ‖a n‖ * (r : ℝ) ^ n)), (r : ENNReal)

-- exercise: exercise_4085

theorem proof_gap_exercise_4085_1
  (f : (ℝ -> ℝ))
  (x : ℝ)
  (y : ℝ)
  (z : ℝ)
  (h1 : x ∈ (Set.univ : Set ℝ))
  (h2 : y ∈ (Set.univ : Set ℝ))
  (h3 : z ∈ (Set.univ : Set ℝ))
  (h4 : ContinuousOn f (Set.Icc 0 2))
  : (∫ x_1 in (0 : ℝ)..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((∫ z_1 in (0 : ℝ)..(x_1 + y_1), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = ((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) + (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ)))) := by
  sorry

theorem proof_gap_exercise_4085_2
  (f : (ℝ -> ℝ))
  (x : ℝ)
  (y : ℝ)
  (z : ℝ)
  (h1 : x ∈ (Set.univ : Set ℝ))
  (h2 : y ∈ (Set.univ : Set ℝ))
  (h3 : z ∈ (Set.univ : Set ℝ))
  (h4 : ContinuousOn f (Set.Icc 0 2))
  (h5 : (∫ x_1 in (0 : ℝ)..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((∫ z_1 in (0 : ℝ)..(x_1 + y_1), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = ((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) + (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ)))))
  : (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) = (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))) := by
  sorry

theorem proof_gap_exercise_4085_3
  (f : (ℝ -> ℝ))
  (x : ℝ)
  (y : ℝ)
  (z : ℝ)
  (h1 : x ∈ (Set.univ : Set ℝ))
  (h2 : y ∈ (Set.univ : Set ℝ))
  (h3 : z ∈ (Set.univ : Set ℝ))
  (h4 : ContinuousOn f (Set.Icc 0 2))
  (h5 : (∫ x_1 in (0 : ℝ)..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((∫ z_1 in (0 : ℝ)..(x_1 + y_1), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = ((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) + (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ)))))
  (h6 : (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) = (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))))
  : (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))) = ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((2 : ℝ) - (z_1 ^ (2 : ℕ)))) * (1 : ℝ)))) := by
  sorry

theorem proof_gap_exercise_4085_4
  (f : (ℝ -> ℝ))
  (x : ℝ)
  (y : ℝ)
  (z : ℝ)
  (h1 : x ∈ (Set.univ : Set ℝ))
  (h2 : y ∈ (Set.univ : Set ℝ))
  (h3 : z ∈ (Set.univ : Set ℝ))
  (h4 : ContinuousOn f (Set.Icc 0 2))
  (h5 : (∫ x_1 in (0 : ℝ)..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((∫ z_1 in (0 : ℝ)..(x_1 + y_1), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = ((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) + (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ)))))
  (h6 : (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) = (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))))
  (h7 : (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))) = ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((2 : ℝ) - (z_1 ^ (2 : ℕ)))) * (1 : ℝ)))))
  : (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), (((f z_1) * (((1 : ℝ) - z_1) + x_1)) * (1 : ℝ))) * (1 : ℝ))) := by
  sorry

theorem proof_gap_exercise_4085_5
  (f : (ℝ -> ℝ))
  (x : ℝ)
  (y : ℝ)
  (z : ℝ)
  (h1 : x ∈ (Set.univ : Set ℝ))
  (h2 : y ∈ (Set.univ : Set ℝ))
  (h3 : z ∈ (Set.univ : Set ℝ))
  (h4 : ContinuousOn f (Set.Icc 0 2))
  (h5 : (∫ x_1 in (0 : ℝ)..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((∫ z_1 in (0 : ℝ)..(x_1 + y_1), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = ((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) + (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ)))))
  (h6 : (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) = (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))))
  (h7 : (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))) = ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((2 : ℝ) - (z_1 ^ (2 : ℕ)))) * (1 : ℝ)))))
  (h8 : (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), (((f z_1) * (((1 : ℝ) - z_1) + x_1)) * (1 : ℝ))) * (1 : ℝ))))
  : (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), (((f z_1) * (((1 : ℝ) - z_1) + x_1)) * (1 : ℝ))) * (1 : ℝ))) = ((1 /. 2) * (∫ z_1 in (1 : ℝ)..(2 : ℝ), (((f z_1) * ((2 - z_1) ^ (2 : ℕ))) * (1 : ℝ)))) := by
  sorry

theorem proof_gap_exercise_4085_6
  (f : (ℝ -> ℝ))
  (x : ℝ)
  (y : ℝ)
  (z : ℝ)
  (h1 : x ∈ (Set.univ : Set ℝ))
  (h2 : y ∈ (Set.univ : Set ℝ))
  (h3 : z ∈ (Set.univ : Set ℝ))
  (h4 : ContinuousOn f (Set.Icc 0 2))
  (h5 : (∫ x_1 in (0 : ℝ)..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((∫ z_1 in (0 : ℝ)..(x_1 + y_1), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = ((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) + (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ)))))
  (h6 : (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((∫ x_1 in z_1..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) + (∫ x_1 in (0 : ℝ)..z_1, ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ)))) * (1 : ℝ))) = (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))))
  (h7 : (((∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((1 : ℝ) - z_1)) * (1 : ℝ))) + (∫ z_1 in (0 : ℝ)..(1 : ℝ), ((((f z_1) * ((1 : ℝ) - z_1)) * z_1) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * (z_1 ^ (2 : ℕ))) * (1 : ℝ))))) = ((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((2 : ℝ) - (z_1 ^ (2 : ℕ)))) * (1 : ℝ)))))
  (h8 : (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), ((∫ y_1 in (z_1 - x_1)..(1 : ℝ), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), (((f z_1) * (((1 : ℝ) - z_1) + x_1)) * (1 : ℝ))) * (1 : ℝ))))
  (h9 : (∫ z_1 in (1 : ℝ)..(2 : ℝ), ((∫ x_1 in (z_1 - 1)..(1 : ℝ), (((f z_1) * (((1 : ℝ) - z_1) + x_1)) * (1 : ℝ))) * (1 : ℝ))) = ((1 /. 2) * (∫ z_1 in (1 : ℝ)..(2 : ℝ), (((f z_1) * ((2 - z_1) ^ (2 : ℕ))) * (1 : ℝ)))))
  : (∫ x_1 in (0 : ℝ)..(1 : ℝ), ((∫ y_1 in (0 : ℝ)..(1 : ℝ), ((∫ z_1 in (0 : ℝ)..(x_1 + y_1), ((f z_1) * (1 : ℝ))) * (1 : ℝ))) * (1 : ℝ))) = (((1 /. 2) * (∫ z_1 in (0 : ℝ)..(1 : ℝ), (((f z_1) * ((2 : ℝ) - (z_1 ^ (2 : ℕ)))) * (1 : ℝ)))) + ((1 /. 2) * (∫ z_1 in (1 : ℝ)..(2 : ℝ), (((f z_1) * ((2 - z_1) ^ (2 : ℕ))) * (1 : ℝ))))) := by
  sorry
