import Mathlib

set_option linter.style.longLine false

open scoped BigOperators Topology Nat

open Filter

local notation:70 x " /. " y => ((x : ℝ) / (y : ℝ))

open scoped RealInnerProductSpace

noncomputable def lpFunDeri {E : Type*} [NormedAddCommGroup E] [InnerProductSpace ℝ E] [CompleteSpace E] (f g : E -> ℝ) : E -> ℝ :=
  fun x => (inner ℝ (gradient f x) (gradient g x)) /. (‖gradient g x‖ ^ 2)

def lpLeftDifferentiable (f : ℝ -> ℝ) : Prop :=
  ∀ x, DifferentiableWithinAt ℝ f (Set.Iio x) x

def lpRightDifferentiable (f : ℝ -> ℝ) : Prop :=
  ∀ x, DifferentiableWithinAt ℝ f (Set.Ioi x) x

def lpLeftDifferentiableOn (f : ℝ -> ℝ) (s : Set ℝ) : Prop :=
  ∀ x ∈ s, DifferentiableWithinAt ℝ f (s ∩ Set.Iio x) x

def lpRightDifferentiableOn (f : ℝ -> ℝ) (s : Set ℝ) : Prop :=
  ∀ x ∈ s, DifferentiableWithinAt ℝ f (s ∩ Set.Ioi x) x

def lpMaximumPoints {α β : Type*} [Preorder β] (f : α -> β) : Set α :=
  {x | ∀ y, f y ≤ f x}

def lpMinimumPoints {α β : Type*} [Preorder β] (f : α -> β) : Set α :=
  {x | ∀ y, f x ≤ f y}

def lpMaximumPointsOn {α β : Type*} [Preorder β] (f : α -> β) (s : Set α) : Set α :=
  {x | x ∈ s ∧ ∀ y ∈ s, f y ≤ f x}

def lpMinimumPointsOn {α β : Type*} [Preorder β] (f : α -> β) (s : Set α) : Set α :=
  {x | x ∈ s ∧ ∀ y ∈ s, f x ≤ f y}

noncomputable def lpRadiusOfConvergence {𝕜 : Type*} [NormedField 𝕜] (a : ℕ -> 𝕜) : ENNReal :=
  ⨆ (r : NNReal), ⨆ (_h : Summable (fun n : ℕ => ‖a n‖ * (r : ℝ) ^ n)), (r : ENNReal)

-- exercise: exercise_1396_8

theorem proof_gap_exercise_1396_8_1
  : (((045 : ℝ) /. (100 : ℝ))) ∈ (Set.Ioo (-(1 : ℝ)) 1) := by
  sorry

theorem proof_gap_exercise_1396_8_2
  (h1 : (((045 : ℝ) /. (100 : ℝ))) ∈ (Set.Ioo (-(1 : ℝ)) 1))
  : |((Real.arcsin (((045 : ℝ) /. (100 : ℝ)))) - (∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))))| ≤ (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))) := by
  sorry

theorem proof_gap_exercise_1396_8_3
  (h1 : (((045 : ℝ) /. (100 : ℝ))) ∈ (Set.Ioo (-(1 : ℝ)) 1))
  (h2 : |((Real.arcsin (((045 : ℝ) /. (100 : ℝ)))) - (∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))))| ≤ (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))))
  : |((∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))) - (((046676 : ℝ) /. (100000 : ℝ))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))) := by
  sorry

theorem proof_gap_exercise_1396_8_4
  (h1 : (((045 : ℝ) /. (100 : ℝ))) ∈ (Set.Ioo (-(1 : ℝ)) 1))
  (h2 : |((Real.arcsin (((045 : ℝ) /. (100 : ℝ)))) - (∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))))| ≤ (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))))
  (h3 : |((∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))) - (((046676 : ℝ) /. (100000 : ℝ))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))))
  : (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))) > 0 := by
  sorry

theorem proof_gap_exercise_1396_8_5
  (h1 : (((045 : ℝ) /. (100 : ℝ))) ∈ (Set.Ioo (-(1 : ℝ)) 1))
  (h2 : |((Real.arcsin (((045 : ℝ) /. (100 : ℝ)))) - (∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))))| ≤ (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))))
  (h3 : |((∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))) - (((046676 : ℝ) /. (100000 : ℝ))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))))
  (h4 : (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))) > 0)
  : (exists (v_uCE_u94 : ℝ), (((v_uCE_u94 ∈ (Set.univ : Set ℝ)) ∧ (v_uCE_u94 ≥ 0)) ∧ (v_uCE_u94 < (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ)))))))) := by
  sorry

theorem proof_gap_exercise_1396_8_6
  (h1 : (((045 : ℝ) /. (100 : ℝ))) ∈ (Set.Ioo (-(1 : ℝ)) 1))
  (h2 : |((Real.arcsin (((045 : ℝ) /. (100 : ℝ)))) - (∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))))| ≤ (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))))
  (h3 : |((∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))) - (((046676 : ℝ) /. (100000 : ℝ))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))))
  (h4 : (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))) > 0)
  (h5 : (exists (v_uCE_u94 : ℝ), (((v_uCE_u94 ∈ (Set.univ : Set ℝ)) ∧ (v_uCE_u94 ≥ 0)) ∧ (v_uCE_u94 < (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ)))))))))
  : |((((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))) - ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))) := by
  sorry

theorem proof_gap_exercise_1396_8_7
  (h1 : (((045 : ℝ) /. (100 : ℝ))) ∈ (Set.Ioo (-(1 : ℝ)) 1))
  (h2 : |((Real.arcsin (((045 : ℝ) /. (100 : ℝ)))) - (∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))))| ≤ (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))))
  (h3 : |((∑ k ∈ Finset.Icc (0 : ℕ) (6 : ℕ), ((((2 * k))! /. ((((4 : ℕ) ^ k) * ((k)! ^ (2 : ℕ))) * ((2 * k) + 1))) * ((((045 : ℝ) /. (100 : ℝ))) ^ ((2 * k) + 1)))) - (((046676 : ℝ) /. (100000 : ℝ))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))))
  (h4 : (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))) > 0)
  (h5 : (exists (v_uCE_u94 : ℝ), (((v_uCE_u94 ∈ (Set.univ : Set ℝ)) ∧ (v_uCE_u94 ≥ 0)) ∧ (v_uCE_u94 < (((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ)))))))))
  (h6 : |((((1 /. 15) * ((((045 : ℝ) /. (100 : ℝ))) ^ (15 : ℕ))) * (1 /. (1 - ((((045 : ℝ) /. (100 : ℝ))) ^ (2 : ℕ))))) - ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))))
  : |((Real.arcsin (((045 : ℝ) /. (100 : ℝ)))) - (((046676 : ℝ) /. (100000 : ℝ))))| ≤ ((((526 : ℝ) /. (100 : ℝ))) * ((10 : ℝ) ^ (-(7 : ℤ)))) := by
  sorry
